upload clean
